scripts/load-test/results/diagnostic/diag-direct-log.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/load-test.js
        output: json (/scripts/results/diagnostic/diag-direct-raw.ndjson)

     scenarios: (100.00%) 1 scenario, 80 max VUs, 50s max duration (incl. graceful stop):
              * ht03_lectura_documentos: 20.00 iterations/s for 20s (maxVUs: 40-80, gracefulStop: 30s)


running (01.0s), 01/40 VUs, 19 complete and 0 interrupted iterations
ht03_lectura_documentos   [   5% ] 01/40 VUs  01.0s/20s  20.00 iters/s

running (02.0s), 04/40 VUs, 36 complete and 0 interrupted iterations
ht03_lectura_documentos   [  10% ] 04/40 VUs  02.0s/20s  20.00 iters/s

running (03.0s), 01/40 VUs, 59 complete and 0 interrupted iterations
ht03_lectura_documentos   [  15% ] 01/40 VUs  03.0s/20s  20.00 iters/s

running (04.0s), 01/40 VUs, 79 complete and 0 interrupted iterations
ht03_lectura_documentos   [  20% ] 01/40 VUs  04.0s/20s  20.00 iters/s

running (05.0s), 00/40 VUs, 100 complete and 0 interrupted iterations
ht03_lectura_documentos   [  25% ] 00/40 VUs  05.0s/20s  20.00 iters/s

running (06.0s), 00/40 VUs, 120 complete and 0 interrupted iterations
ht03_lectura_documentos   [  30% ] 00/40 VUs  06.0s/20s  20.00 iters/s

running (07.0s), 00/40 VUs, 140 complete and 0 interrupted iterations
ht03_lectura_documentos   [  35% ] 00/40 VUs  07.0s/20s  20.00 iters/s

running (08.0s), 00/40 VUs, 160 complete and 0 interrupted iterations
ht03_lectura_documentos   [  40% ] 00/40 VUs  08.0s/20s  20.00 iters/s

running (09.0s), 00/40 VUs, 180 complete and 0 interrupted iterations
ht03_lectura_documentos   [  45% ] 00/40 VUs  09.0s/20s  20.00 iters/s

running (10.0s), 00/40 VUs, 200 complete and 0 interrupted iterations
ht03_lectura_documentos   [  50% ] 00/40 VUs  10.0s/20s  20.00 iters/s

running (11.0s), 00/40 VUs, 220 complete and 0 interrupted iterations
ht03_lectura_documentos   [  55% ] 00/40 VUs  11.0s/20s  20.00 iters/s

running (12.0s), 00/40 VUs, 240 complete and 0 interrupted iterations
ht03_lectura_documentos   [  60% ] 00/40 VUs  12.0s/20s  20.00 iters/s

running (13.0s), 00/40 VUs, 260 complete and 0 interrupted iterations
ht03_lectura_documentos   [  65% ] 00/40 VUs  13.0s/20s  20.00 iters/s

running (14.0s), 00/40 VUs, 280 complete and 0 interrupted iterations
ht03_lectura_documentos   [  70% ] 00/40 VUs  14.0s/20s  20.00 iters/s

running (15.0s), 00/40 VUs, 300 complete and 0 interrupted iterations
ht03_lectura_documentos   [  75% ] 00/40 VUs  15.0s/20s  20.00 iters/s

running (16.0s), 00/40 VUs, 320 complete and 0 interrupted iterations
ht03_lectura_documentos   [  80% ] 00/40 VUs  16.0s/20s  20.00 iters/s

running (17.0s), 00/40 VUs, 340 complete and 0 interrupted iterations
ht03_lectura_documentos   [  85% ] 00/40 VUs  17.0s/20s  20.00 iters/s

running (18.0s), 00/40 VUs, 360 complete and 0 interrupted iterations
ht03_lectura_documentos   [  90% ] 00/40 VUs  18.0s/20s  20.00 iters/s

running (19.0s), 00/40 VUs, 380 complete and 0 interrupted iterations
ht03_lectura_documentos   [  95% ] 00/40 VUs  19.0s/20s  20.00 iters/s

running (20.0s), 00/40 VUs, 400 complete and 0 interrupted iterations
ht03_lectura_documentos   [ 100% ] 00/40 VUs  20.0s/20s  20.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 800     39.997178/s
    checks_succeeded...: 100.00% 800 out of 800
    checks_failed......: 0.00%   0 out of 800

    ✓ status es 200
    ✓ cuerpo con forma esperada

    CUSTOM
    ht03_respuestas_por_instancia...: 400    19.998589/s

    HTTP
    http_req_duration...............: avg=29.5ms  min=6.87ms med=10.6ms  max=498.83ms p(90)=67.02ms p(95)=155.61ms p(99)=219.79ms
      { expected_response:true }....: avg=29.5ms  min=6.87ms med=10.6ms  max=498.83ms p(90)=67.02ms p(95)=155.61ms p(99)=219.79ms
    http_req_failed.................: 0.00%  0 out of 400
    http_reqs.......................: 400    19.998589/s

    EXECUTION
    iteration_duration..............: avg=31.55ms min=7.27ms med=11.13ms max=509.11ms p(90)=70.74ms p(95)=169.01ms p(99)=220.87ms
    iterations......................: 400    19.998589/s
    vus.............................: 0      min=0        max=4 
    vus_max.........................: 40     min=40       max=40

    NETWORK
    data_received...................: 1.2 MB 62 kB/s
    data_sent.......................: 175 kB 8.7 kB/s



running (20.0s), 00/40 VUs, 400 complete and 0 interrupted iterations
ht03_lectura_documentos ✓ [ 100% ] 00/40 VUs  20s  20.00 iters/s